app/controllers/alarms_controller.rb

SELECT count(*) AS count_all FROM "alarms"
---
  def index
    respond_to do |format|
      format.html     # index.html.erb (no data required)
      format.ext_json { render :json => find_alarms.to_ext_json(:class => Alarm, :count => Alarm.count(options_from_search(Alarm)), :include => [:alarm_order, :alarm_period_warning, :contract]) }

INSERT INTO "alarms" ("warning_type", "updated_at", "alarm_period_warning_id", "alarm_order_id", "created_at") VALUES('E-mail', '2008-12-20 16:42:26', 1, 1, '2008-12-20 16:42:26')
---
  def create
    @alarm = Alarm.new(params[:alarm])

    respond_to do |format|
      if @alarm.save

DELETE FROM "alarms" WHERE "id" = 1
---
  def destroy
    @alarm.destroy

SELECT * FROM "alarms" WHERE ("alarms"."id" = 1)
---
    def find_alarm
      @alarm = Alarm.find(params[:id])

SELECT * FROM "alarms" ORDER BY id ASC LIMIT 25 OFFSET 0
SELECT * FROM "alarm_orders"
SELECT * FROM "alarm_period_warnings"
---
    def find_alarms
      pagination_state = update_pagination_state_with_params!(Alarm)



      if(params[:inicial_alarm] == "true")
        alarm_type_email = AlarmTypeWarning.find(:first, :select=>'id, name', :conditions=>['name = ?', "Página inicial"])
        @alarms = Array.new
        @alarms_it = Alarm.find(:all, options_from_pagination_state(pagination_state).merge(options_from_search(Alarm)))

        @alarms_it.each do |alarm|

          # Obtem data final do contrato
          contract_end_date = alarm.contract.contract_end_date
          # Obtem periodo de ativo do alarme
          period_warning = alarm.alarm_period_warning.name.sub(/ [a-z]+$/, '').to_i
          # Obtem a ordem do contrato a ser comparado (Anterior/Apos vencimento)
          alarm_order = alarm.alarm_order.id
          debugger
          if(((contract_end_date.between?(Date.today, Date.today+period_warning) && alarm_order == 1) ||
            (contract_end_date.between?(Date.today-period_warning, Date.today) && alarm_order == 1)) ||
            ((contract_end_date.between?(Date.today, Date.today+period_warning) && alarm_order == 2) ||
            (contract_end_date.between?(Date.today-period_warning, Date.today) && alarm_order == 2)) &&
            alarm.alarm_type_warnings.include?(alarm_type_email) == true && alarm.group_id == session[:group_id])