app/controllers/categories_controller.rb

SELECT * FROM "categories" WHERE (1 = 1 and parent_id = 1) ORDER BY lft
---
  def index(id = params[:node])
    respond_to do |format|

      @categories = Array.new

      Category.find_children(id).each do |category|