app/controllers/clients_controller.rb

SELECT count(*) AS count_all FROM "clients"
---
  def index
    respond_to do |format|
      format.html     # index.html.erb (no data required)
      format.ext_json { render :json => find_clients.to_ext_json(:class => Client, :count => Client.count(options_from_search(Client))) }