app/controllers/contracts_controller.rb

  def index
    respond_to do |format|
      format.html     # index.html.erb (no data required)
      format.ext_json { render :json => find_contracts.to_ext_json(:class => Contract, :count => Contract.count(options_from_search(Contract)), :include => [:contract_category, :contract_type]) }
---
SELECT count(*) AS count_all FROM "contracts"