app/controllers/groups_controller.rb

  def index
    respond_to do |format|
      format.html     # index.html.erb (no data required)
      format.ext_json { render :json => find_groups.to_ext_json(:class => Group, :count => Group.count(options_from_search(Group))) }
---
SELECT count(*) AS count_all FROM "groups"

  def destroy
    @group.destroy
---
DELETE FROM "groups" WHERE "id" = 27

    def find_group
      @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 27)