app/controllers/login_controller.rb

  def do_login
      #render :text => '{ success: true}'
      username = params[:username]
      password = params[:password]

      @user = User.find(:first, :conditions => [ "username = ?", username])
---
SELECT * FROM "users" WHERE (username = 'psaux') LIMIT 1