app/controllers/users_controller.rb

  def index
    respond_to do |format|
      format.html     # index.html.erb (no data required)
      format.ext_json { render :json => find_users.to_ext_json(:class => User, :count => User.count(options_from_search(User))) }
---
SELECT count(*) AS count_all FROM "users"

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "updated_at", "username", "group_id", "password", "email", "created_at") VALUES('123', '2008-12-20 16:47:57', '123', 1, NULL, '123@123.com', '2008-12-20 16:47:57')

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "id" = 4

    def find_user
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 4)